android/AndroidClient/res/raw/checkvalidusername.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CheckValidUsername xmlns="http://tempuri.org/">
      <username>{username}</username>
    </CheckValidUsername>
  </soap:Body>
</soap:Envelope>